Autodesk.Revit.DB.TableSectionData.SetRowHeightInPixels(System.Int32,System.Int32)
This sets a row's height in pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.
-or-
The row height is outside of acceptable range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is forbidden for cells in standard schedule body sections.

Autodesk.Revit.DB.TableSectionData.GetRowHeightInPixels(System.Int32)
This returns a row's height in pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given row number nRow is invalid.

Autodesk.Revit.DB.TableSectionData.SetColumnWidthInPixels(System.Int32,System.Int32)
This sets a column's width in pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.
-or-
The column width is outside of acceptable range.

Autodesk.Revit.DB.TableSectionData.GetColumnWidthInPixels(System.Int32)
This returns a column's width in pixels
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given column number nCol is invalid.